;/////// ************************************************************ //////////////////////////////
;/////// определение кол. строк при размещении текста в графе ПЭ "Наименование"  ///////////////////
;/////// ************************************************************ //////////////////////////////
(defun dlt-y-for-le-110

(txt-string / box-txt dlt-y len-txt)

;txt-string - строка текста, которую нужно вписать в графу "наименование"
;column-width - ширина графы "наименование" перечня элементов
;dlt-y-le - отступ, на который надо переместить строку по вертикали вниз

(setq column-width 107 
			box-txt (textbox (list (cons 1 txt-string)))
			len-txt (- (car (nth 1 box-txt)) (car (nth 0 box-txt)))
			dlt-y (+ (fix (/ len-txt column-width)) 1)
			dlt-y-le (* dlt-y 8)
);setq

(gc)
(princ)
)
;/////// *************************************************************//////////////////////////////
;/////// КОНЕЦ ПРОГРАММЫ                                              //////////////////////////////
;/////// *************************************************************//////////////////////////////